






s_list = [
    [1,'홍길동',100,90,99],
    [2,'유관순',100,100,99],
    [3,'이순신',100,100,99],
    [4,'강감찬',100,90,99],
    [5,'김구',90,90,99]
  ]
  # 합계, 평균 추가해서 전체를 출력하시오.
  # 1 홍길동 100 90 99 289 92.00
for i in s_list:
  i.append(i[2] + i[3] + i[4])
  i.append(round(i[5]/3, 2))
  i.append(0)

s_title = ['번호', '이름', '국어', '영어', '수학', '합계', '평균', '등수']

for s in s_title:
  print(s, end='\t')
print()
print('-' * 60)


for s in s_list:
  print(f'{s[0]}\t{s[1]}\t{s[2]}\t{s[3]}\t{s[4]}\t{s[5]}\t{s[6]:.2f}\t{s[7]}')